/****************************************************************************
Description	: Definitions for each product functionality
----------------------------------------------------------------------------
Author			: Yaskawa Electric Corp.,
					Copyright (c) 2012 All Rights Reserved

Project			: Mercury

----------------------------------------------------------------------------
Changes :
	Name	Date		Description
  ------------------------------------------------------------------------
	Y.Oka	2012.08.06	created

******************************************************************************/
#ifndef _SYSTEM_SETTING_H
#define _SYSTEM_SETTING_H

/*****************************************************************************/
/*		Product information													 */
/*****************************************************************************/
#define SERVO_FIRM_VER		0xF0010806	/* ソフトウェアVer. */
										/* byte4:メジャーVer. */
										/* byte3:マイナーVer. */
										/* byte1,2:Build number */

#define PRM_VERSION			0x0001		/* パラメータVer. */

#define MAX_AXIS_NUMBER		1			/* 最大接続軸数 */
#define MAX_SLOT_NUMBER		1			/* 最大スロット(ASIC)数 */


/*****************************************************************************/
/*		デバッグ用コンパイルSW定義											 */
/*****************************************************************************/
#if !defined(CSW_CSTR_MBB_TYPE) && defined(CSW_BSP_CSTR_IFM3)
#define CSW_CSTR_DB_REVERSE		TRUE
#endif


#define CSW_CSTR_IF_PROTO_USE		FALSE
#define CSW_CSTR_AUTO_ADDR_CFG		FALSE	/* MDINIT=ON時の自動軸アドレス割り付け有無 */
#define CSW_DEBUG_PRINT_EBABLE		FALSE
#define CSW_DX_CONVERTER_USE		FALSE
#define CSW_DIF_USE					FALSE
#ifdef _VC_DEBUG_
//#define CSW_NO_SERVO_ASICS
#define CSW_NO_M3_ASICS
#else
//#define CSW_NO_SERVO_ASICS
#endif


#define	CSW_SCANA_ENABLE				/* CPU ScanA処理有効 */


/****************************************************************************/
/*		サーボ機能選択スイッチ(CSW_SVCF_****)								*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*		電子ギア使用・不使用設定(処理時間対策)								*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_EGEAR_USE			TRUE
/*--------------------------------------------------------------------------*/
/*		モデル追従制御使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_MFC_USE			TRUE
/*--------------------------------------------------------------------------*/
/*		A型制振制御使用・不使用設定											*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_ATYPE_RES_VIB_USE	TRUE
/*--------------------------------------------------------------------------*/
/*		振動検出使用・不使用設定											*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_VIB_DETECT_USE		TRUE
/*--------------------------------------------------------------------------*/
/*		振動抑制フィルタ使用・不使用設定									*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_RESVIB_FIL_USE		TRUE
/*--------------------------------------------------------------------------*/
/*		弱め界磁制御使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_WEAKENFIELD_USE	TRUE
/*--------------------------------------------------------------------------*/
/*		マイクロ電圧補償ゲイン機能使用・不使用設定							*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_MPKVVCOMP			TRUE
/*--------------------------------------------------------------------------*/
/*		外乱オブザーバ使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_DISTURBOBS			TRUE
/*--------------------------------------------------------------------------*/
/*		フルクローズド制御使用・不使用設定									*/
/*--------------------------------------------------------------------------*/
#define CSW_FULC_NO_SUPPORT			0	/* フルク制御無効 					*/
#define CSW_FULC_SB_SUPPORT			1	/* フルク制御有効(ScanB位置ループ)	*/
//#define CSW_FULC_SA_SUPPORT		2	/* フルク制御有効(ScanA位置ループ)	*/
#define CSW_SVCF_FULC_MODE			CSW_FULC_NO_SUPPORT
/*--------------------------------------------------------------------------*/
/*		バックラッシ使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_BACKLASHCOMP		FALSE
/*--------------------------------------------------------------------------*/
/*		FB位置ラッチ使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_FBLATCH			FALSE


/****************************************************************************/
/*		スキャン周期、実行タイミング定義									*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*		サイクルタイム定義													*/
/*--------------------------------------------------------------------------*/
#define NS_CHANGE_MS	1000000					/* [ms] ⇒ [ns]変換係数		*/
#define US_CHANGE_MS	1000					/* [us] ⇒ [ms]変換係数		*/
#define NS_CHANGE_US	1000					/* [ns] ⇒ [us]変換係数		*/

/*--------------------------------------------------------------------------*/
/*		JL-077μスキャン周期												*/
/*--------------------------------------------------------------------------*/
#define KPI_MACYCLENS	15625							/* ScanI Cycle[ns]	*/
#define KPI_MBCYCLENS	62500							/* MprgB Cycle[ns]	*/
#define KPI_SACYCLENS	62500							/* ScanA Cycle[ns]	*/
#define KPI_SACYCLEUS	((KPI_SACYCLENS + 500)/1000)	/* ScanA Cycle[us]	*/
#define KPI_MBCYCLEUS	((KPI_MBCYCLENS + 500)/1000)	/* MprgB Cycle[us]	*/
#define KPI_SACOUNTMS	(1000000/KPI_SACYCLENS)			/* ScanA Cycle Count per 1ms */

/*--------------------------------------------------------------------------*/
/*		ScanB周期(ScanB周期はパラメータで決まるため、デフォルト値を定義)	*/
/*--------------------------------------------------------------------------*/
#define KPI_SBCYCLE_BASE_NS		125000		/* ScanB Base Cycle Time [ns]	*/
#define KPI_SBCYCLE_TIME		2			/* ScanB Cycle Time [125us]		*/

/*--------------------------------------------------------------------------*/
/*		ScanC周期														 	*/
/*--------------------------------------------------------------------------*/
#define KPI_SCCYCLEMS			2
#define KPI_SCCYCLEUS			( KPI_SCCYCLEMS * 1000  )
#define KPI_SCANC_MS( ms )		( (ms)/KPI_SCCYCLEMS )

/*--------------------------------------------------------------------------*/
/*		MECHATROLINK処理タイミング定義										*/
/*--------------------------------------------------------------------------*/
#define SCAN_N_DEFCYCLE			1				/* デフォルト通信TASK周期[ScanBカウント] */
#define CFG_TIO_BASE_TIME		500				/* サーボ制御周期[0.25us]	*/
#define CFG_POSERR_DELAY		KPI_MBCYCLENS	/* 位置偏差モニタ用補正時間[ns] */



/*****************************************************************************/
/*		電源関連、HW制御機能SW定義											 */
/*****************************************************************************/
/*---------------------------------------------------------------------------*/
/*		DMA転送有効スイッチ													 */
/*---------------------------------------------------------------------------*/
#define CSW_MAICRO_DMA_TRANSFER	FALSE	/* Enable DMA transfer for JL077-uP and CPU */
#define CSW_M3_DMA_TRANSFER		FALSE	/* Enable DMA transfer for JL100 and CPU */

/*---------------------------------------------------------------------------*/
/*		PN Voltage Detect by Decimation Filter(PnE0C.bit13, PnE7Cで定義)	 */
/*---------------------------------------------------------------------------*/
/* PnE0C.bit13=1 & このSWで切り替え(後でパラメータOnlyにする) */
#define AD_DETECT_DECIMATION		TRUE

#if(CSW_DX_CONVERTER_USE==FALSE)

#define CSW_HW_POWER_MANAGE			TRUE	/* 電源管理処理実行選択 */
#define CSW_HW_REGENERATION_CTRL	TRUE	/* 回生処理選択*/
#define CSW_HW_CHKRUSH				TRUE	/* 突入抵抗過負荷検出選択 */
#define CSW_HW_DC_DETECT			TRUE	/* DC電源電圧検出選択 */
#define CSW_HW_DCBUS				FALSE	/* DC入力モード選択 */

#else

#define CSW_HW_POWER_MANAGE			FALSE	/* 電源管理処理実行選択 */
#define CSW_HW_REGENERATION_CTRL	FALSE	/* 回生処理選択*/
#define CSW_HW_CHKRUSH				FALSE	/* 突入抵抗過負荷検出選択 */
#define CSW_HW_DC_DETECT			FALSE	/* DC電源電圧検出選択 */
#define CSW_HW_DCBUS				FALSE	/* DC入力モード選択 */

#endif

/*---------------------------------------------------------------------------*/
/*		DB制御実行選択														 */
/*---------------------------------------------------------------------------*/
#define CSW_HW_DB_CTRL				TRUE
/*---------------------------------------------------------------------------*/
/*		HWBB制御実行選択													 */
/*---------------------------------------------------------------------------*/
#define CSW_HW_HWBB_SUPPORT			FALSE

/*---------------------------------------------------------------------------*/
/*		複数軸同時インタロック機能選択										 */
/*---------------------------------------------------------------------------*/
#ifdef CSW_BSP_SGDZ_IFBS80
#define CSW_SVON_INTERLOCK
#define SVON_LOCK_GRP1				0x00000006		// Axis 1 and 2 on CB2 board
#define SVON_LOCK_GRP2				0x000000f8		// Axis 3 and 8 on CC board
#define SVON_LOCK_GRP1_MAX			1
#define SVON_LOCK_GRP2_MAX			3

#define OH_ALM_SLOT_GRP1			0x00000006		// Axis 1 and 2 on CB2 board
#define OH_ALM_SLOT_GRP2			0x000000f8		// Axis 3 and 8 on CC board

#endif	//CSW_BSP_SGDZ_IFBS80

/*****************************************************************************/
/*		その他																 */
/*****************************************************************************/
/*---------------------------------------------------------------------------*/
/*		Amp and Mot Type Definition											 */
/*---------------------------------------------------------------------------*/
#define MOTTYPE_ROTARY				0x00		/* 回転型モーター */
#define MOTTYPE_LINEAR				0x01		/* リニアモーター */

/*---------------------------------------------------------------------------*/
/*		Un Monitor Average time												 */
/*---------------------------------------------------------------------------*/
#define SVCDEF_UNSPD_SCMEANNUM		((64 + KPI_SCCYCLEMS - 1) / KPI_SCCYCLEMS)
#define SVCDEF_UNSPD_SCMEANTMMS		( KPI_SCCYCLEMS * SVCDEF_UNSPD_SCMEANNUM )

/*---------------------------------------------------------------------------*/
/*		Normalize Multiplier Factor											 */
/*---------------------------------------------------------------------------*/
#define NORM_TRQ_TO_IQ			3840000		/* TrqRef(2^24) --> IqRef(15000) */
#define NORM_IQ_TO_TRQ			73300775	/* IqRef(15000) --> TrqRef(2^24) */



extern LONG NumberOfAxes;		// 制御軸数



#endif /* _SYSTEM_SETTING_H */

